{"_id":{"$oid":"5a26a0e53d25a47855576056"},"number":"EM.411","term":"2017FA","title":"Foundations of System Design and Management\n","description":"Presents the foundations of systems architecture, systems engineering and project management in an integrated format, through a synchronized combination of in-class discussion, industrial guest speakers, team projects, and individual assignments. Topics include stakeholder analysis, project planning and monitoring, requirements definition, concept generation and selection, complexity management, system integration, verification and validation, cost modeling, systems safety, organizational design and effective teamwork, risk management, and leadership styles. Restricted to students in the SDM program.\n","lecturer":"B. Moser, E. Crawley, B. Cameron","lectures":[{"day":"MW","startTime":"11:00","endTime":"13:00","place":"1-390"}],"recitations":[{"day":"TR","startTime":"12:00","endTime":"13:00","place":"1-390"},{"day":"TR","startTime":"13:00","endTime":"14:00","place":"1-390"}]}
{"_id":{"$oid":"5a26a2ee3d25a478555764d7"},"number":"1.125","term":"2017FA","title":"Architecting \u0026 Engineering Software Systems\n","description":"Software architecting and design of  software-intensive systems. Targeted at future CTOs who must understand both the business and technical issues involved in architecting enterprise-scale systems. Student teams confront technically challenging problems. Lectures and readings cover core database, XML, web server components and browser issues in a distributed web service environment. Enrollment limited.\n","lecturer":"J. Williams","lectures":[{"day":"TR","startTime":"14:30","endTime":"16:00","place":"1-390"}]}
{"_id":{"$oid":"5a26ac683d25a47855577667"},"number":"15.871","term":"2017FA","title":"Introduction to System Dynamics\n","description":"Introduction to systems thinking and system dynamics modeling applied to strategy, organizational change, and policy design. Students use simulation models, management flight simulators, and case studies to develop conceptual and modeling skills for the design and management of high-performance organizations in a dynamic world. Case studies of successful applications of system dynamics in growth strategy, management of technology, operations, supply chains, product development, and others. Principles for effective use of modeling in the real world. Meets with 15.8741 first half of term when offered concurrently. Expectations and evaluation criteria differ for students taking half-term graduate version; consult syllabus or instructor for specific details.\n","lecturer":"D. Keith, H. Rahmandad, N. Repenning, J. Sterman","lectures":[{"day":"MW","startTime":"13:00","endTime":"14:30","place":"E62-262"},{"day":"MW","startTime":"14:30","endTime":"16:00","place":"E62-276"},{"day":"MW","startTime":"13:00","endTime":"14:30","place":"E51-145"},{"day":"MW","startTime":"14:30","endTime":"16:00","place":"E51-145"}],"recitations":[{"day":"F","startTime":"10:00","endTime":"11:30","place":"E62-250"},{"day":"F","startTime":"14:30","endTime":"16:00","place":"E51-315"},{"day":"F","startTime":"8:30","endTime":"10:00","place":"E62-250"},{"day":"F","startTime":"14:30","endTime":"16:00","place":"E51-315"}]}
{"_id":{"$oid":"5a2944b53d25a478555d51cf"},"number":"15.401AB","term":"2017FA","lectures":[]}
{"_id":{"$oid":"5a2944b73d25a478555d5208"},"number":"15.401A","term":"2017FA","lectures":[]}
